IDEA Open Model
Polygon2D Class
Compatible with IDEA StatiCa 20.1
 Represents a polygon in two-dimensional space.
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.Geometry2D.Polygon2D
 IdeaRS.OpenModel.Geometry2D.TemperatureCurve2D
 Namespace: IdeaRS.OpenModel.Geometry2D
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public class Polygon2D : OpenObject
Public Class Polygon2D
	Inherits OpenObject
The Polygon2D type exposes the following members.
Constructors
Name | Description
Polygon2D
 Constructor
Top
Properties
Name | Description
Points
 List of polygon points
Top
See Also
Reference
IdeaRS.OpenModel.Geometry2D Namespace